## 输出第四列前面加上对应序号
echo "输出表头 第四列前面加上对应序号"
awk 'FNR==1 {printf "%s %-20s %-20s\n" ,"Num",$1,$4}' OFS="\t" netstat.txt
awk 'FNR!=1 {printf "%03s %-20s %-20s\n" ,FNR-1,$1,$4}' OFS="\t" netstat.txt

## 不要忘记printf的f
## 不要忘记printf之后的参数格式的""
## 不要忘记第一个列（这里是FNR）之前的逗号,
## 不要忘记换行符号\n，printf不会自动加的


# Num Proto                Local
# 001 tcp4                 192.168.10.102.62562
# 002 tcp4                 192.168.10.102.62560
# 003 tcp4                 localhost.socks
# 004 tcp4                 localhost.62559
# 005 tcp4                 192.168.10.102.62558
# 006 tcp4                 localhost.socks
# 007 tcp4                 localhost.62557
# 008 tcp4                 192.168.10.102.62554
# 009 tcp4                 192.168.10.102.62553
# 010 tcp4                 192.168.10.102.62552
# 011 tcp4                 192.168.10.102.62549
# 012 tcp4                 192.168.10.102.62548
# 013 tcp4                 192.168.10.102.62547
# 014 tcp4                 192.168.10.102.62546
# 015 tcp4                 192.168.10.102.62545
# 016 tcp4                 192.168.10.102.62544
# 017 tcp4                 192.168.10.102.62543
# 018 tcp4                 192.168.10.102.62542
# 019 tcp4                 192.168.10.102.62539
# 020 tcp4                 192.168.10.102.62538
# 021 tcp4                 192.168.10.102.62537
# 022 tcp4                 192.168.10.102.62536
# 023 tcp4                 192.168.10.102.62535
# 024 tcp4                 192.168.10.102.62534